{
  "Structure_Blueprint": {
    "Q1_percentage": 20,
    "Q2_percentage": 35,
    "Q3_percentage": 45,
    "typical_total_chars": 3800,
    "notes": "The essays consistently follow a three-part structure: initial motivation, academic/super-curricular engagement, and extracurricular activities/transferable skills, often starting with a personal hook."
  },
  "Style_Bible": [
    "Rule 1: Begin with a specific, authentic personal anecdote or observation that sparked initial interest in the subject.",
    "Rule 2: Substantiate all claims of interest or skill with specific examples, projects, or experiences, detailing actions and outcomes.",
    "Rule 3: Reflect on experiences, articulating insights gained, skills developed, and how these connect to the chosen course and future aspirations.",
    "Rule 4: Provide concrete details, specific concepts, and where possible, quantifiable results to illustrate engagement and impact.",
    "Rule 5: Maintain a clear, cohesive narrative that consistently links all experiences and skills back to the chosen subject and suitability for university."
  ],
  "Section_Tone": {
    "Q1_tone": "Enthusiastic, insightful, personally driven, and forward-looking, demonstrating genuine curiosity and a clear understanding of the subject's scope and personal relevance.",
    "Q2_tone": "Analytical, reflective, demonstrating intellectual curiosity, academic rigor, and the ability to apply theoretical knowledge to practical scenarios.",
    "Q3_tone": "Proactive, responsible, demonstrating initiative, leadership, teamwork, resilience, and a commitment to personal growth and broader societal impact."
  },
  "Common_Phrases": [
    "My fascination with [subject/concept] began when...",
    "This experience solidified my understanding of [concept/principle]...",
    "I actively sought opportunities to [action, e.g., apply, explore, develop]...",
    "Through [project/activity], I honed my [skill, e.g., analytical, problem-solving, leadership] abilities...",
    "Reflecting on this, I realised the importance of [insight/lesson]...",
    "I am particularly drawn to [specific aspect of course] because...",
    "This has equipped me with a foundational understanding of...",
    "I am eager to contribute to [field/society] by..."
  ],
  "Anti_Patterns": [
    "Avoid generic statements or clichés that could apply to any applicant or subject; always provide specific evidence.",
    "Do not merely list achievements or activities; always reflect on the learning, skills gained, and their relevance.",
    "Do not include experiences that do not clearly link back to the chosen course or demonstrate relevant transferable skills.",
    "Avoid passive language; use active verbs to demonstrate personal agency and initiative.",
    "Do not write in an overly formal or dry academic tone; maintain an engaging and authentic voice."
  ],
  "_metadata": {
    "analyzed_chunks": 50,
    "analysis_date": "Tue Jan 13 22:58:31 IST 2026",
    "model_used": "gemini-2.5-flash"
  }
}